---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeKey.Dispose
source: html/fa88d59e-f2f8-435a-a3e4-64343f2f9dda.htm
---
# Autodesk.Revit.DB.ExportLinetypeKey.Dispose Method

Releases all resources used by the ExportLinetypeKey

## Syntax (C#)
```csharp
public void Dispose()
```